Revit 2027 API
RebarFreeFormAccessor.GetServerGUID Method
 Returns the GUID of the API server.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid GetServerGUID()
Public Function GetServerGUID As Guid
public:
Guid GetServerGUID()
member GetServerGUID : unit -> Guid
Return Value
Guid
 The GUID of the API server
Exceptions
Exception | Condition
InvalidOperationException |  This RebarFreeFormAccessor doesn't contain a valid rebar reference.
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace